[
  {
    "name": "Albedo",
    "premium_team": {
      "Main DPS": "Xiao",
      "Sub DPS": "Albedo",
      "Healer": "Jean",
      "Support": "Zhongli"
    },
    "premium_team_details": ["- Albedo is one of the few Sub-DPS that works well with Xiao", "- Zhongli & Albedo together will have Geo Resonance", "- Jean will act as a battery for Xiao and healer for the whole team"]
  },
  {
    "name": "Alhaitham",
    "premium_team": ["Alhaitham", "Nahida", "Xingqiu", "Kuki Shinobu"],
    "premium_team_details": "- Alhaitham works amazing with Hyperbloom & Spread Comps.\n- Nahida can provide additional EM and DMG for the team.\n- Kuki Shinobu are great off-field Electro for consistent activation of Spread and Hyperbloom.\n- Xingqiu is the main enabler, allowing consistent production of Bloom Orbs and additional damage as well."
  },
  {
    "name": "Aloy",
    "premium_team": ["Aloy", "Hu Tao", "Venti", "Bennett"],
    "premium_team_details": "- Aloy is the sub-DPS dealing melt reactions once its Burst is ready.\n- Hu Tao is the main DPS that also spread Pyro through her marks.\n- Venti will control the crowd with his burst.\n- Bennett will boost the damage that Aloy and Hu Tao deals."
  },
  {
    "name": "Anemo Traveler",
    "premium_team": ["Anemo Traveler", "Klee", "Yelan", "Bennett"],
    "premium_team_details": "- Anemo Traveler can shred the elemental resistance of the enemies enabling Klee & Yelan to execute them easily. She can also apply elemental resistance debuff based on the absorbed element.\n- Klee acts as the main DPS who can consistently deal Pyro DMG that can be swirled by Anemo Traveler & proc vaporize with Yelan. In addition, the remaining mines from her Skill can be displaced with Anemo Traveler's Skill & Burst.\n└ Can decrease the enemies' DEF at constellation 2\n- Bennett enables Pyro resonance with Klee. He can also provide cleansing heal & ATK buff with his Burst.\n- Yelan's Burst can perform coordinated Hydro attacks with Klee that can inflict powerful vaporize DMG."
  },
  {
    "name": "Ayaka",
    "premium_team": ["Ayaka", "Mona", "Kazuha", "Diona"],
    "premium_team_details": "- A permafreeze comp for Ayaka\n- Mona will provide additional DMG while doing Freeze with Ayaka\n- Kazuha can act as an enabler and shred for Cryo\n- Diona will provide shield, healing, and Cryo resonance with Ayaka"
  },
  {
    "name": "Ayato",
    "premium_team": ["Ayato", "Nahida", "Kuki Shinobu", "Yun Jin"],
    "premium_team_details": "- Ayato will act as the Main DPS for the team, dealing high damage with his skill and triggering various hydro reactions.\n- Nahida will boost the Elemental Mastery of Ayato and enables Bloom to happen.\n- Kuki Shinobu will handle the heals and also support the team damage through Hyperbloom.\n- Yun Jin will increase Normal Attack DMG and ATK SPD (If c6) of Ayato."
  },
  {
    "name": "Childe (Tartaglia)",
    "premium_team": ["Childe", "Fischl", "Beidou", "Sucrose"],
    "premium_team_details": "- The OG Taser comp, even with Sumeru it's still one of Childe's best comps\n- Childe will act as an enabler and on-field DPS. With his Skill, he can continously apply Hydro while the rest of the team apply Electro for Electrocharge\n- Sucrose will apply Elemental shred, further increasing the damage of the team"
  },
  {
    "name": "Cyno",
    "premium_team": ["Cyno", "Fischl", "Nahida", "Kokomi"],
    "premium_team_details": "- Cyno will be the main DPS in this team.\n- Fischl is an effective way to battery the team.\n- Dendro Traveler will boost the Electro damage of Cyno through reactions.\n- Kokomi can heal the team and can also help with damage through Dendro Cores."
  },
  {
    "name": "Dehya",
    "premium_team": ["Dehya", "Ganyu", "Bennett", "Nahida"],
    "premium_team_details": "- Dehya works great in Melt Ganyu situation since it increases her overall damage\n- Dehya, Bennett and Nahida can trigger Burning which can be melted by Ganyu\n- Nahida's Burst also increases the EM of the team which can boost Melt & Burning DMG"
  },
  {
    "name": "Dendro Traveler",
    "premium_team": ["Dendro Traveler", "Yae Miko", "Raiden Shogun", "Kokomi"],
    "premium_team_details": "- Dendro Traveler works great with Raiden Shogun because Raiden Shogun can cover for Dendro Traveler's High Burst Cost.\n- Yae Miko will be extra powerful because of the Dendro Reaction, Quicken.\n- Kokomi can heal and can also trigger Bloom that can lead to Hyper Bloom due to the existence of many Electro Attacks."
  },
  {
    "name": "Diluc",
    "premium_team": ["Diluc", "Xingqiu", "Bennett", "Kazuha"],
    "premium_team_details": "- Diluc will be the on-field DPS of the team, being supported by his party member's on-field abilities\n- Xingqiu will be able to properly proc Vaporize with his Burst with Diluc\n- Bennett will provide a number of support abilties, including increase in DMG and whole team ATK increase with Pyro resonance\n- Kazuha will provide Elemental Shred for the whole team"
  },
  {
    "name": "Electro Traveler",
    "premium_team": [
      "Electro Traveler",
      "Childe (Tartaglia)",
      "Kazuha",
      "Diona"
    ],
    "premium_team_details": "- Electro Traveler is a great energy support due to his skill. He can easily work with any team comp especially those who requires energy for Elemental Burst.\n- Childe is able to apply hydro to multiple enemies, making him great with Traveler as they can easily Electrocharge enemies\n- Crowd control to easily apply elemental combos and bursts to enemies. Use Kazuha's skill to group enemies and buff the team.\n- Diona can provide powerful shields and healing sustaining the team."
  },
  {
    "name": "Eula",
    "premium_team": ["Eula", "Raiden Shogun", "Diona", "Yun Jin"],
    "premium_team_details": "- Eula will mainly deal damage and spread cryo using her skill and burst.\n- Raiden provides additional damage while spreading Electro enabling constant superconduct debuff to enemies.\n- Diona provides shields, heals and elemental resonance.\n- Yun Jin increases the damage of Normal Attacks of Eula."
  },
  {
    "name": "Ganyu",
    "premium_team": ["Ganyu", "Xiangling", "Bennett", "Zhongli"],
    "premium_team_details": "- A melt comp for Ganyu\n- Xiangling will combo with Ganyu for Melt with her Elemental Burst\n- Bennett & Xiangling provides additional damage through Pyro Resonance\n- Zhongli's shield will allow Ganyu to spam her Charged Attack without being interrupted"
  },
  {
    "name": "Geo Traveler",
    "premium_team": ["Geo Traveler", "Zhongli", "Yae Miko", "Mona"],
    "premium_team_details": "- The Traveler's role is to use Elemental Skill & Burst which produces Geo construct that pulsates with Zhongli's monolith that deals Geo DMG.\n- Zhongli's shield can be sustained so it is ok to not use any healer. Geo resonance with the Geo Traveler can also increase damage output of the team.\n- Yae Miko's Skill & Burst can damage the enemies without getting blocked by the Geo construct created by Geo Traveler & Zhongli.\n- Mona' Skill can proc electro-charged with Yae Miko. She can deal powerful Hydro damage while boosting the team's overall damage with her Burst."
  },
  {
    "name": "Hu Tao",
    "premium_team": ["Hu Tao", "Yelan", "Xingqiu", "Zhongli"],
    "premium_team_details": "- The double hydro Vape team for Hu Tao\n- Hydro resonance from Yelan & Xingqiu will also support Hu Tao\n- Zhongli is in a flex spot, so can be exchanged for either a healer or Anemo support for shred"
  },
  {
    "name": "Itto",
    "premium_team": ["Arataki Itto", "Gorou", "Zhongli", "Raiden Shogun"],
    "premium_team_details": "- Arataki Itto will be the main DPS of the team.\n- Gorou will boost the DMG of Gorou providing additional Geo DMG and defense.\n- Albedo will be the Geo Battery and a sub-DPS.\n- Raiden will be the Battery and the sub-DPS during the down time of Arataki Itto's Elemental Burst."
  },
  {
    "name": "Jean",
    "premium_team": ["Jean", "Mika", "Fischl", "Layla"],
    "premium_team_details": "- A Physical DMG team build for Jean\n- Jean will be the on-field DPS as she deals Physical DMG\n- Fischl and Leyla can work together to constantly proc Superconduct\n- Mika can increase the Physical DMG of Jean"
  },
  {
    "name": "Kazuha",
    "premium_team": ["Kazuha", "Nahida", "Kuki Shinobu", "Ayato"],
    "premium_team_details": "- Hyperbloom Team with Kazuha\n- Ayato as main DPS will work well with Kuki Shinobu and Nahida for continues Bloom and Hyperbloom\n- Kazuha will increase the DMG of the team of the whole and apply shred to enemies.\n- Kazuha increases the EM of characters at higher constellations enabling higher DMG for reaction"
  },
  {
    "name": "Keqing",
    "premium_team": ["Keqing", "Nahida", "Kuki Shinobu", "Zhongli"],
    "premium_team_details": "- An aggravate team comp with Keqing as the main DPS\n- Nahida will allow easy and continuous Dendro application\n- Kuki Shinobu will provide healing for the team and her skill will allow proc of Quicken while Keqing does Aggravate\n- Zhongli is in a flex slot and can be switched with an Anemo for shred"
  },
  {
    "name": "Klee",
    "premium_team": ["Klee", "Rosaria", "Kazuha", "Layla"],
    "premium_team_details": "- A Melt Comp centered around Klee\n- Cryo resonance will increase team's Crit Rate\n- Kazuha & Layla will provide shield and constant Cryo application\n- Klee will be the on-field DPS, triggering Melt"
  },
  {
    "name": "Kokomi",
    "premium_team": ["Kokomi", "Nilou", "Nahida", "Dendro Traveler"],
    "premium_team_details": "- Bloom comp with Kokomi.\n- Kokomi will be able to keep her team alive as they continuously get hit by bloom\n- Nilou will be the on-field DPS with Nahida ensuring continuous Dendro application\n- Dendro Traveler is there for EM buff and additional Dendro infliction."
  },
  {
    "name": "Mona",
    "premium_team": ["Mona", "Fischl", "Kuki Shinobu", "Kazuha"],
    "premium_team_details": "- A electro-charged team centered around Mona\n- Fischl & Kuki Shinobu will secure continuous Electo application\n- Kuki can heal the team\n- Kazuha will apply elemental shred and even CC enemies for Mona's Burst"
  },
  {
    "name": "Nahida",
    "premium_team": ["Nahida", "Cyno", "Dendro Traveler", "Kokomi"],
    "premium_team_details": "- Nahida will mainly be an off-field Dendro support in this team.\n- Cyno will be the main DPS triggering Aggravate for increased damage.\n- Dendro Traveler will give Dendro Resonance\n- Kokomi is the main healer and enables Bloom reactions."
  },
  {
    "name": "Nilou",
    "premium_team": ["Nilou", "Kokomi", "Dendro Traveler", "Nahida"],
    "premium_team_details": "- Nilou will be the enabler in this team, focusing on spreading Hydro on-field to trigger multiple instances of Bloom.\n- Kokomi will heal the team using its Elemental Skill preventing damage from Dendro Cores.\n- Dendro Traveler and Nahida provides the off-field Dendro allowing the continuous production of Blooms."
  },
  {
    "name": "Qiqi",
    "premium_team": ["Eula", "Fischl", "Beidou", "Qiqi"],
    "premium_team_details": "- A superconduct team- Beidou and Fischl will continuously provide Electro for Superconduct\n- Qiqi's Elemental Skill will allow continous proc of Superconduct while Eula is on the field"
  },
  {
    "name": "Raiden Shogun",
    "premium_team": ["Raiden Shogun", "Xiangling", "Xingqiu", "Bennett"],
    "premium_team_details": "- National Team variant called \"Raiden National.\"\n- Raiden Shogun provides Elemental DMG bonus and Energy for the whole team.\n- Raiden Shogun DMG and resistance at Burst makes her the perfect Main DPS for National Team.\n- Xiangling's ULT gets boosted by Bennett's Burst and Raiden.\n- Xingqiu's Elemental Burst allows consistent Vaporized and is not disturbed by Electro since Electro-charged keeps both Hydro and Electro.\n- Bennett keeps the team alive and well while providing a very high ATK Buff."
  },
  {
    "name": "Scaramouche (Wanderer)",
    "premium_team": ["Wanderer", "Faruzan", "Yelan", "Bennett"],
    "premium_team_details": "- Scaramouche will be the main DPS dealing Anemo DMG with his skill and powerful Normal Attack.\n- Faruzan is there for reduction of Anemo Resistance and DMG boost.\n- Yelan is another off-field DPS that can provide additional buff to Wanderer and Hydro Swirl.\n- Bennett for ATK buff, heals and allows Scaramouche to swirl Pyro."
  },
  {
    "name": "Shenhe",
    "premium_team": ["Ayaka", "Shenhe", "Sucrose", "Diona"],
    "premium_team_details": "- A mono cryo comp with Shenhe as support\n- Ayaka can fully take advantage of Shenhe's Cryo buffs\n- Diona will provide healing and shields\n- Sucrose will provide increased Elemental DMG for the team"
  },
  {
    "name": "Tighnari",
    "premium_team": ["Tighnari", "Collei", "Fischl", "Kuki Shinobu"],
    "premium_team_details": "- Collei would not only help by producing extra damage, she can also resonate with Tighnari for Dendro Resonance.\n- Fischl enables Tighnari to trigger Quicken while also providing energy and extra damage.\n- Kuki Shinobi can heal and resonate with Fischl for Electro Resonance."
  },
  {
    "name": "Venti",
    "premium_team": ["Ganyu", "Mona", "Venti", "Diona"],
    "premium_team_details": "- The OG Perma Freeze comp, even with Sumeru it's still one of Venti's best comps\n- Venti will apply Cryo shred and elemental infusion to increase Cryo DMG\n- Mona will provide Hydro for Freeze, Burst will also increase DPS\n- Ganyu will be the main DPS, charge shots should be used when Venti's Burst is active\n- Mona will provide healing and additional Cryo application"
  },
  {
    "name": "Xiao",
    "premium_team": ["Xiao", "Albedo", "Jean", "Zhongli"],
    "premium_team_details": "- Very expensive team comp, but currently, the best team comp for Xiao\n- Jean will act as a battery for Xiao, while providing healing for the team\n- Albedo will provide on-field DPS with his Elemental Skill\n- Zhongli can offer shred and a shield for Xiao"
  },
  {
    "name": "Yae Miko",
    "premium_team": ["Yae Miko", "Dendro Traveler", "Fischl", "Jean"],
    "premium_team_details": "- Proc consistent aggravate through Yae Miko, Fischl, and Dendro Traveler\n- Yae Miko will be the on-field main DPS\n- Jean will Swirl and provide healing for the team"
  },
  {
    "name": "Yelan",
    "premium_team": ["Yelan", "Yoimiya", "Kazuha", "Diona"],
    "premium_team_details": "- Since Yelan's elemental burst synergizes with the active character's normal attacks, she is great to pair with a character that can perform swift normal attacks.\n- Yoimiya focuses mainly on normal attack which deals powerful Pyro DMG. Vaporize can happen when paired with Yelan.\n- Kazuha can boost elemental damage & has a great crowd control that can shred the enemies' elemental resistance.\n- Diona can support the whole team with a shield & an AOE that can simultaneously heal and deal Cryo damage to the enemies."
  },
  {
    "name": "Yoimiya",
    "premium_team": ["Yoimiya", "Raiden Shogun", "Xingqiu", "Yun Jin"],
    "premium_team_details": "- Proc Overload and Vape simultaneously with Yoimiya, Raiden Shogun, and Xingqiu\n- Yun Jin will provide a buff to Yoimiya's Normal Attack, while also providing a shield to prevent interruptions"
  },
  {
    "name": "Zhongli",
    "premium_team": ["Itto", "Albedo", "Gorou", "Zhongli"],
    "premium_team_details": "- A mono Geo team comp\n- Itto as main DPS will receive support from Gorou and Zhongli\n- Zhongli will ensure Itto doesn't get interrupted during his Burst\n- Albedo will probably additional on-field DPS"
  },
  {
    "name": "Amber",
    "premium_team": ["Amber", "Mona", "Jean", "Dehya"],
    "premium_team_details": "- A Physical DMG team build for Amber\n- Amber will be the on-field DPS as she deals Physical DMG and procs the on-field abilities of Xingqiu & Dehya\n- Jean can keep the team together with healing. If she has a VV set, she can increase the Elemental DMG in the team"
  },
  {
    "name": "Barbara",
    "premium_team": ["Barbara", "Dendro Traveler", "Nahida", "Nilou"],
    "premium_team_details": "- Barbara is the healer of the team who can also produce Dendro cores together with Nilou\n- Dendro Resonance increases bloom damage\n- Nahida can further amplify bloom damage\n- Nilou works well with Barbara because of HP increase through Resonance that benefits both of them and also upgrades Dendro cores to Bountiful cores"
  },
  {
    "name": "Beidou",
    "premium_team": ["Beidou", "Nahida", "Yae Miko", "Kokomi"],
    "premium_team_details": "- Beidou acts as the main Electro DPS who can also be a shielder at C1.\n- Nahida is can inflict Dendro that can be sustained which can trigger strong reactions and works perfectly with Electro & Hydro.\n- Yae Miko can provide a powerful off-field Electro DPS and can also give additional Energy particles with Electro Resonance.\n- Kokomi is a great healer and Hydro applicator. She can contribute to produce Dendro cores that can be triggered by either Yae Miko or Beidou for additional damage."
  },
  {
    "name": "Bennett",
    "premium_team": ["Xiao", "Albedo", "Zhongli", "Bennett"],
    "premium_team_details": "- Whole team is centered on non-reaction damage\n- Xiao as a hyper carry will greatly benefit from Bennett's Burst (Healing & ATK Boost)\n- Albedo will provide additional DMG, while Zhongli's shield will save the team from incoming DMG"
  },
  {
    "name": "Candace",
    "premium_team": ["Candace", "Ayato", "Xiangling", "Bennett"],
    "premium_team_details": "- Candace will be the main support in this team boosting the normal attack of the team.\n- Ayato gets boosted through Hydro Resonance and Normal Attack Buff.\n- Xiangling will be the sub-DPS dealing Vaporized .\n- Bennett will buff team and provide stable healing."
  },
  {
    "name": "Chongyun",
    "premium_team": ["Chongyun", "Ayaka", "Kazuha", "Kokomi"],
    "premium_team_details": "- In this team, Chongyun acts as a support. His Elemental Skill buff can be maximized by Ayaka.\n- Ayaka is a powerful main DPS who can consistently deal Cryo DMG. Chongyun's Skill is beneficial to Ayaka since it can help her to sustain the Cryo infusion which is helpful in conserving stamina as Ayaka does not need to sprint much to get Cryo infusion.\n- Kazuha can amplify the elemental DMG of Ayaka when Cryo gets absorbed in his Burst. In addition, he can gather lightweight enemies with his Skill and also spread Hydro to nearby enemies for Ayaka & Chongyun to freeze.\n- Kokomi is a great healer & Hydro applicator who can help the team to freeze the enemies."
  },
  {
    "name": "Collei",
    "premium_team": ["Collei", "Yoimiya", "Kokomi", "Yun Jin"],
    "premium_team_details": "- Collei can deal multiple explosions helping Yoimiya with its lack of AoE through dendro reactions with Hydro & Pyro.\n- Yun Jin boosts Yoimiya enabling her to deal more damage.\n- Kokomi is there for healing and spreading hydro."
  },
  {
    "name": "Diona",
    "premium_team": ["Diona", "Diluc", "Venti", "Xingqiu"],
    "premium_team_details": "- Diona as a support can easily apply Cryo to enemies with Elemetal Skill, while also creating a shield. She won't be an onfield DPS, but she can be relied on to spread Cryo to enemies when she's out.\n- Diluc will be the on field damage dealer. After Diona uses her Elemental Skill, switch to Diluc and use any of his skills to proc Melt. He can then stay on the field until Diona's cooldowns are over\n- Venti can easily group enemies. Have him use his Elemental Burst, then Diona's Elemental Skill to swirl Cryo. This can then finished off with either Diluc to create Melt\n- Xingqiu is there to produce additional off-field DMG."
  },
  {
    "name": "Dori",
    "premium_team": ["Eula", "Raiden Shogun", "Rosaria", "Dori"],
    "premium_team_details": "- Dori's role on the team is to provide Electro infliction and build Elemental Burst for the main DPS\n- Raiden and Dori can work together for the uptime of super conduct and charging the Energy of the team.\n- Rosaria can spread Cryo and increase physical damage for bigger damage from Eula. - Eula with her powerful Physical attack will be the main DPS in this team."
  },
  {
    "name": "Faruzan",
    "premium_team": ["Faruzan", "Wanderer", "Yelan", "Bennett"],
    "premium_team_details": "- Faruzan is there for reduction of Anemo Resistance and DMG boost.\nScaramouche will be the main DPS dealing Anemo DMG with his skill and powerful Normal Attack.\n- Yelan is another off-field DPS that can provide additional buff to Wanderer and Hydro Swirl.\n- Bennett for ATK buff, heals and allows Scaramouche to swirl Pyro."
  },
  {
    "name": "Fischl",
    "premium_team": ["Fischl", "Yoimiya", "Zhongli", "Yelan"],
    "premium_team_details": "- Fischl can deploy Oz easily with Skill & Burst. At C6, Oz can perform a coordinated attack and can shoot additional projectiles on top of the auto-attack.\n- Yoimiya is with Fischl as they can easily trigger Overload and since Yoimiya has a quick Normal Attack, she can maximize Fischl's C6.\n- Zhongli has a durable shield that can be sustained. Since you are shielded, a healer is not necessary unless you can sustain the shield and if you encounter corrosion debuff.\n- Yelan is a great off-field Hydro DPS that can synergize with Yoimiya's Normal Attack. In addition, she can contribute triggering elemental reactions with Yoimiya & Fischl."
  },
  {
    "name": "Gorou",
    "premium_team": ["Gorou", "Arataki Itto", "Albedo", "Raiden Shogun"],
    "premium_team_details": "- Gorou will be the main support of the team boosting the damage of Itto and Albedo.\n- With Goro, Itto will get boosted damage and less interruption.\n- Albedo's flowers will have more damage because of Defense boost by Gorou.\n- Gorou's high Burst cost will make Raiden easily stack Sigils for her Elemental Burst.\n- Albedo and Raiden will help in providing Energy for a stable Burst for the whole team."
  },
  {
    "name": "Kaeya",
    "premium_team": ["Kaeya", "Diluc", "Venti", "Bennett"],
    "premium_team_details": "- Kaeya's Burst is great to pair with Diluc for melt reaction.\n- Diluc acts as the main DPS of the team. Switch between Diluc & Kaeya and maximize their Skills & Bursts to continuously trigger melt reaction. It is also best to use his Burst after Venti has compressed the lightweight enemies.\n- Venti's Burst has crowd control that works well with either Kaeya or Diluc since whether it's Cryo or Pyro that gets swirled, it works for the team. His Burst also prevents enemies from being knocked back when hit by Diluc's Burst\n- Bennett provides healing & ATK buff from his Burst. In addition, the team gains 25% ATK from Pyro resonance."
  },
  {
    "name": "Kujou Sara",
    "premium_team": ["Kujou Sara", "Yae Miko", "Kokomi", "Nahida"],
    "premium_team_details": "- Kujou Sara is an amazing ATK buffer for Electro DPS characters like Yae Miko.\n- Kokomi is there for heals and also works well with Nahida and Yae for consistent reactions.\n- Nahida increases the DMG of Kujou Sara through Catalyst reactions."
  },
  {
    "name": "Kuki Shinobu",
    "premium_team": ["Kuki Shinobu", "Childe", "Dendro Traveler", "Collei"],
    "premium_team_details": "- Kuki Shinobi would be an off-field enabler that will only be on-field during Elemental Skill and Burst.\n- Childe has an amazing Hydro infliction that will produce several blooms easily..\n- Dendro Traveler and Collei provides the off-field Dendro allowing the continuous production of Blooms.\n- Dendro resonance increases the team's Elemental Mastery producing higher damage."
  },
  {
    "name": "Layla",
    "premium_team": ["Layla", "Ayaka", "Yelan", "Kokomi"],
    "premium_team_details": "- Layla works well in Freeze comps and Physical teams.\n- Kokomi and Yelan produces Hydro resonance furthering the strength of the shields and damage of Layla.\n- Ayaka will be the main damage dealer."
  },
  {
    "name": "Lisa",
    "premium_team": ["Alhaitham", "Fischl", "Lisa", "Yaoyao"],
    "premium_team_details": "- An Spread team comp\n- Lisa will be able to proc Spread with Alhaitham, and add DEF shred as well\n- Fischl will ensure that Lisa will have her Burst up a lot\n- Alhaitham as the main DPS can fully take advantage of the aggravate from the team\n- Yaoyao can provide additional Dendro application, but she will most be used for Support/Healing"
  },
  {
    "name": "Mika",
    "premium_team": ["Mika", "Eula", "Raiden Shogun", "Zhongli"],
    "premium_team_details": "- Eula will be the main DPS in this team comp\n- Raiden will periodically deal Electro DMG for triggering superconduct\n- Zhongli will protect the active character with a shield that can decrease the Elemental & Physical resistance of nearby enemies and will also provide resistance to interruption.\n- Mika will increase Eula's damage output via Elemental Skill & will restore HP when needed. Can also provide additional DMG via Ocean Hued Clam."
  },
  {
    "name": "Ningguang",
    "premium_team": ["Ningguang", "Zhongli", "Raiden Shogun", "Yelan"],
    "premium_team_details": "- Zhongli provides a durable shield that can be sustained & monolith that enables Ningguang's Skill to pulsate that deals damage to nearby enemies.\n└ With Geo Resonance, gain DMG Bonus & shred the enemies' Geo RES.\n- Raiden is a powerful Electro DPS who can also increase Elemental Burst DMG of everyone in the team.\n- Yelan works well with Ningguang since Ningguang uses Normal & Charged Attack a lot."
  },
  {
    "name": "Noelle",
    "premium_team": ["Noelle", "Albedo", "Gorou", "Zhongli"],
    "premium_team_details": "- A Mono-Geo team for Noelle\n- Funnel all of the energy you get from both Zhongli and Albedo to Noelle\n- On-field abilities will provide additional DMG while Noelle is on the field\n- Gorou will work well with a Mono-Geo comp\n- Zhongli's shield will keep Noelle protected"
  },
  {
    "name": "Razor",
    "premium_team": ["Razor", "Fischl", "Yun Jin", "Qiqi"],
    "premium_team_details": "- A Superconduct team for Razor\n- Fischl will act as a battery for Razor\n- Yun Jin will increase the damage of Razor's Normal Attack while also providing a shield\n- Qiqi will provide constant Cryo application. Best if she has Sacrifical Sword for a good Skill uptime"
  },
  {
    "name": "Rosaria",
    "premium_team": ["Rosaria", "Raiden Shogun", "Yun Jin", "Diona"],
    "premium_team_details": "- Physical Main DPS team with Rosaria as the main DPS\n- Raiden Shogun will provide constant Electro application for Superconduct\n- Diona will provide shield and healing\n- Yun Jin will increase the damage of Rosaria's Normal Attack"
  },
  {
    "name": "Sayu",
    "premium_team": ["Sayu", "Ganyu", "Mona", "Layla"],
    "premium_team_details": "- Sayu will spread Viridescent Venerer debuff while providing needed healing for the team and additional DMG.\n- Ganyu will be the main DPS dealing powerful shots to enemies.\n- Mona and will help Ganyu have a safer playing field by freezing enemies.\n- Layla provides shields for the team."
  },
  {
    "name": "Shikanoin Heizou",
    "premium_team": ["Shikanoin Heizou", "Fischl", "Xiangling", "Barbara"],
    "premium_team_details": "- Heizou, as the main DPS, can deal swirl damage periodically which inflicts additional damage.\n- Fischl provides consistent off-field Electro DPS and can produce either swirl-electro or overload elemental reaction.\n- Xiangling's Guoba gives additional ATK & her elemental burst is great for off-field Pyro DPS. She can also be acquired for free when you finish Abyss 3-3.\n- Barbara, as a free hero, should be the go-to healer. When equipped with Thrilling Tales of Dragon Slayers, she can provide additional ATK to the next character that will be switched."
  },
  {
    "name": "Sucrose",
    "premium_team": ["Sucrose", "Klee", "Yelan", "Bennett"],
    "premium_team_details": "- Sucrose can gather the enemies enabling Klee & Yelan to execute combos easily. She can also amplify the vaporize DMG by increasing the Elemental Mastery of DPS & Sub DPS\n└ Can also increase Elemental DMG at constellation 6\n- Klee acts as the main DPS who can consistently deal Pyro DMG that can be swirled by Sucrose & proc vaporize with Yelan. In addition, the remaining mines from her Skill can be pulled with Sucrose's Skill & Burst.\n└ Can decrease the enemies' DEF at constellation 2\n- Bennett enables Pyro resonance with Klee. He can also provide cleansing heal & ATK buff with his Burst.\n- Yelan's Burst can perform coordinated Hydro attacks with Klee that can inflict powerful vaporize DMG."
  },
  {
    "name": "Thoma",
    "premium_team": ["Ayato", "Nahida", "Kazuha", "Thoma"],
    "premium_team_details": "- A burgeon team comp for Thoma\n- Nahida and Ayato will provide continuous Dendro Cores\n- Thoma's slow Pyro application will insure you deal Burgeon instead of burning\n- Kazuha will be able to increase the team's damage and deal shred to enemies"
  },
  {
    "name": "Xiangling",
    "premium_team": ["Xiangling", "Bennett", "Childe", "Kazuha"],
    "premium_team_details": "- Xiangling will act as a Sub DPS dealing Pyro to enemies off-field.\n- With Bennett, her attacks will be further boosted with resonance and buff from Burst.\n- Childe is a great as an on-field DPS with Xiangling since Childe will be able to deal powerful Vaporize damage consistently.\n- Kazuha will buff the damage of Childe and Xiangling."
  },
  {
    "name": "Xingqiu",
    "premium_team": ["Xingqiu", "Yelan", "Hu Tao", "Zhongli"],
    "premium_team_details": "- Xingqiu and Yelan produces Hydro Resonance increasing the HP and boosting the damage of Hu Tao through reaction.\n- Xingqiu and Hu Tao produces consistent Vaporize reaction.\n- Hydro Resonance also affects the HP shield of Zhongli.\n- Zhongli can also increase the damage that Xingqiu produces because of its universal debuff from shields."
  },
  {
    "name": "Xinyan",
    "premium_team": ["Xinyan", "Eula", "Raiden Shogun", "Bennett"],
    "premium_team_details": "- Xinyan can increase the Physical DMG of DPS with her shields making her a great Sub-DPS for Eula.\n- Eula will be the main DPS and can also deal Melt with Xinyan.\n- Fischl can activate super-conduct with Eula enabling Xinyan's burst to deal more DMG.\n- Bennett's Elemental Burst will work well with Xinyan as it can heal her and amp up her damage further. Additionally, Bennett and Xinyan will have Pyro Resonance"
  },
  {
    "name": "Yanfei",
    "premium_team": ["Yanfei", "Xingqiu", "Zhongli", "Bennett"],
    "premium_team_details": "- Yanfei will deal DMG to Hydro inflicted enemies.\n- Xingqiu will inflict constant Hydro to enemies.\n- Zhongli will debuff the enemies with his shields and crowd control using his Burst.\n- Bennett will give buff to the whole team with his Burst."
  },
  {
    "name": "Yaoyao",
    "premium_team": ["Yaoyao", "Cyno", "Nahida", "Fischl"],
    "premium_team_details": "- Yaoyao can be an off-field dendro and healer.\n- Cyno works well with any off-field Dendro because he needs reactions.\n- Fischl is for energy regeneration of the party.\n- Nahida for Elemental Resonance."
  },
  {
    "name": "Yun Jin",
    "premium_team": ["Yoimiya", "Raiden Shogun", "Jean", "Yun Jin"],
    "premium_team_details": "- An overload team wherein Yun Jin increases Yoimiya's damage\n- Bulk of the damage will come from Yoimiya and Raiden Shogun\n- Jean will provide good healing for the team and elemental shred"
  }
]
